In [7]:
d1 = {
    'key1':[1,2,3,4,5,6],
    'key2':[7,8,9,10,11,12],
    'key3':[13,14,15,16,17,18],
    'key4':[19,20,21,22,23,24]
}

In [5]:
import pandas as pd

In [14]:
df1 = pd.DataFrame(d1)

In [17]:
df1

   key1  key2  key3  key4
0     1     7    13    19
1     2     8    14    20
2     3     9    15    21
3     4    10    16    22
4     5    11    17    23
5     6    12    18    24

In [12]:
d2 = {
    'key1':[1,2,3,4,5,"sudh"],
    'key2':[7,8,"kumar",10,11,12],
    'key3':[13,14,15,16,17,18],
    'key4':[19,20,21,"ineuron","pwskills",24]
}

In [15]:
df2 = pd.DataFrame(d2)

In [16]:
df2

   key1   key2  key3      key4
0     1      7    13        19
1     2      8    14        20
2     3  kumar    15        21
3     4     10    16   ineuron
4     5     11    17  pwskills
5  sudh     12    18        24

## Merge Operation

In [18]:
pd.merge(df1,df2)

  key1 key2  key3 key4
0    1    7    13   19
1    2    8    14   20

In [23]:
pd.merge(df1,df2,how='inner', on='key1')

  key1  key2_x  key3_x  key4_x key2_y  key3_y    key4_y
0    1       7      13      19      7      13        19
1    2       8      14      20      8      14        20
2    3       9      15      21  kumar      15        21
3    4      10      16      22     10      16   ineuron
4    5      11      17      23     11      17  pwskills

In [24]:
pd.merge(df1,df2,how='inner', on='key4')

   key1_x  key2_x  key3_x key4 key1_y key2_y  key3_y
0       1       7      13   19      1      7      13
1       2       8      14   20      2      8      14
2       3       9      15   21      3  kumar      15
3       6      12      18   24   sudh     12      18

In [25]:
pd.merge(df1,df2,how='left', on='key1')

  key1  key2_x  key3_x  key4_x key2_y  key3_y    key4_y
0    1       7      13      19      7    13.0        19
1    2       8      14      20      8    14.0        20
2    3       9      15      21  kumar    15.0        21
3    4      10      16      22     10    16.0   ineuron
4    5      11      17      23     11    17.0  pwskills
5    6      12      18      24    NaN     NaN       NaN

In [27]:
pd.merge(df1,df2,how='left',on='key4')

   key1_x  key2_x  key3_x key4 key1_y key2_y  key3_y
0       1       7      13   19      1      7    13.0
1       2       8      14   20      2      8    14.0
2       3       9      15   21      3  kumar    15.0
3       4      10      16   22    NaN    NaN     NaN
4       5      11      17   23    NaN    NaN     NaN
5       6      12      18   24   sudh     12    18.0

In [30]:
pd.merge(df1,df2,how='right', on='key4')

/Users/kushjoshi/opt/anaconda3/lib/python3.9/site-packages/pandas/core/reshape/merge.py:916: FutureWarning: In a future version, the Index constructor will not infer numeric dtypes when passed object-dtype sequences (matching Series behavior)
  key_col = Index(lvals).where(~mask_left, rvals)

   key1_x  key2_x  key3_x      key4 key1_y key2_y  key3_y
0     1.0     7.0    13.0      19.0      1      7      13
1     2.0     8.0    14.0      20.0      2      8      14
2     3.0     9.0    15.0      21.0      3  kumar      15
3     NaN     NaN     NaN   ineuron      4     10      16
4     NaN     NaN     NaN  pwskills      5     11      17
5     6.0    12.0    18.0      24.0   sudh     12      18

In [31]:
pd.merge(df1,df2,how='outer', on='key4')

/Users/kushjoshi/opt/anaconda3/lib/python3.9/site-packages/pandas/core/reshape/merge.py:916: FutureWarning: In a future version, the Index constructor will not infer numeric dtypes when passed object-dtype sequences (matching Series behavior)
  key_col = Index(lvals).where(~mask_left, rvals)

   key1_x  key2_x  key3_x      key4 key1_y key2_y  key3_y
0     1.0     7.0    13.0      19.0      1      7    13.0
1     2.0     8.0    14.0      20.0      2      8    14.0
2     3.0     9.0    15.0      21.0      3  kumar    15.0
3     4.0    10.0    16.0      22.0    NaN    NaN     NaN
4     5.0    11.0    17.0      23.0    NaN    NaN     NaN
5     6.0    12.0    18.0      24.0   sudh     12    18.0
6     NaN     NaN     NaN   ineuron      4     10    16.0
7     NaN     NaN     NaN  pwskills      5     11    17.0

In [39]:
d11 = {
    'a':[1,2,3,4,5,6],
    'b':[7,8,9,10,11,12],
    'c':[13,14,15,16,17,18],
    'd':[19,20,21,22,23,24]
}

In [40]:
d12 = {
    'key1':[1,2,3,4,5,"sudh"],
    'key2':[7,8,"kumar",10,11,12],
    'key3':[13,14,15,16,17,18],
    'key4':[19,20,21,"ineuron","pwskills",24]
}

In [41]:
df11 = pd.DataFrame(d11)

In [42]:
df12 = pd.DataFrame(d12)

In [43]:
df11

   a   b   c   d
0  1   7  13  19
1  2   8  14  20
2  3   9  15  21
3  4  10  16  22
4  5  11  17  23
5  6  12  18  24

In [44]:
df12

   key1   key2  key3      key4
0     1      7    13        19
1     2      8    14        20
2     3  kumar    15        21
3     4     10    16   ineuron
4     5     11    17  pwskills
5  sudh     12    18        24

In [46]:
pd.merge(df11,df12,how='left', left_on='a', right_on='key1')

   a   b   c   d key1   key2  key3      key4
0  1   7  13  19    1      7  13.0        19
1  2   8  14  20    2      8  14.0        20
2  3   9  15  21    3  kumar  15.0        21
3  4  10  16  22    4     10  16.0   ineuron
4  5  11  17  23    5     11  17.0  pwskills
5  6  12  18  24  NaN    NaN   NaN       NaN

In [47]:
df1

   key1  key2  key3  key4
0     1     7    13    19
1     2     8    14    20
2     3     9    15    21
3     4    10    16    22
4     5    11    17    23
5     6    12    18    24

In [48]:
df2

   key1   key2  key3      key4
0     1      7    13        19
1     2      8    14        20
2     3  kumar    15        21
3     4     10    16   ineuron
4     5     11    17  pwskills
5  sudh     12    18        24

In [73]:
d10 = {
    'key11':[1,2,3,4,5,6],
    'key21':[7,8,9,10,11,12],
    'key31':[13,14,15,16,17,18],
    'key41':[19,20,21,22,23,24]
}

In [74]:
d20 = {
    'key1':[1,2,3,4,5,"sudh"],
    'key2':[7,8,"kumar",10,11,12],
    'key3':[13,14,15,16,17,18],
    'key4':[19,20,21,"ineuron","pwskills",24]
}

In [105]:
df10 = pd.DataFrame(d10, index = [1,2,3,4,5,'kj'])

In [97]:
df20 = pd.DataFrame(d20, index = [1,2,3,4,5,6])

In [98]:
df10

   key11  key21  key31  key41
1      1      7     13     19
2      2      8     14     20
3      3      9     15     21
4      4     10     16     22
5      5     11     17     23
6      6     12     18     24

In [99]:
df20

   key1   key2  key3      key4
1     1      7    13        19
2     2      8    14        20
3     3  kumar    15        21
4     4     10    16   ineuron
5     5     11    17  pwskills
6  sudh     12    18        24

In [100]:
df10.join(df20)

   key11  key21  key31  key41  key1   key2  key3      key4
1      1      7     13     19     1      7    13        19
2      2      8     14     20     2      8    14        20
3      3      9     15     21     3  kumar    15        21
4      4     10     16     22     4     10    16   ineuron
5      5     11     17     23     5     11    17  pwskills
6      6     12     18     24  sudh     12    18        24

In [101]:
df10.join(df20,how = 'inner')

   key11  key21  key31  key41  key1   key2  key3      key4
1      1      7     13     19     1      7    13        19
2      2      8     14     20     2      8    14        20
3      3      9     15     21     3  kumar    15        21
4      4     10     16     22     4     10    16   ineuron
5      5     11     17     23     5     11    17  pwskills
6      6     12     18     24  sudh     12    18        24

In [102]:
df10.join(df20,how = 'left')

   key11  key21  key31  key41  key1   key2  key3      key4
1      1      7     13     19     1      7    13        19
2      2      8     14     20     2      8    14        20
3      3      9     15     21     3  kumar    15        21
4      4     10     16     22     4     10    16   ineuron
5      5     11     17     23     5     11    17  pwskills
6      6     12     18     24  sudh     12    18        24

In [103]:
df10.join(df20,how = 'right')

   key11  key21  key31  key41  key1   key2  key3      key4
1      1      7     13     19     1      7    13        19
2      2      8     14     20     2      8    14        20
3      3      9     15     21     3  kumar    15        21
4      4     10     16     22     4     10    16   ineuron
5      5     11     17     23     5     11    17  pwskills
6      6     12     18     24  sudh     12    18        24

In [104]:
df10.join(df20,how = 'outer')

   key11  key21  key31  key41  key1   key2  key3      key4
1      1      7     13     19     1      7    13        19
2      2      8     14     20     2      8    14        20
3      3      9     15     21     3  kumar    15        21
4      4     10     16     22     4     10    16   ineuron
5      5     11     17     23     5     11    17  pwskills
6      6     12     18     24  sudh     12    18        24

__

In [107]:
df10.join(df20,how = 'inner')

   key11  key21  key31  key41 key1   key2  key3      key4
1      1      7     13     19    1      7    13        19
2      2      8     14     20    2      8    14        20
3      3      9     15     21    3  kumar    15        21
4      4     10     16     22    4     10    16   ineuron
5      5     11     17     23    5     11    17  pwskills

In [109]:
df10.join(df20,how = 'outer')

    key11  key21  key31  key41  key1   key2  key3      key4
1     1.0    7.0   13.0   19.0     1      7  13.0        19
2     2.0    8.0   14.0   20.0     2      8  14.0        20
3     3.0    9.0   15.0   21.0     3  kumar  15.0        21
4     4.0   10.0   16.0   22.0     4     10  16.0   ineuron
5     5.0   11.0   17.0   23.0     5     11  17.0  pwskills
6     NaN    NaN    NaN    NaN  sudh     12  18.0        24
kj    6.0   12.0   18.0   24.0   NaN    NaN   NaN       NaN

In [110]:
df10.join(df20,how = 'left')

    key11  key21  key31  key41 key1   key2  key3      key4
1       1      7     13     19    1      7  13.0        19
2       2      8     14     20    2      8  14.0        20
3       3      9     15     21    3  kumar  15.0        21
4       4     10     16     22    4     10  16.0   ineuron
5       5     11     17     23    5     11  17.0  pwskills
kj      6     12     18     24  NaN    NaN   NaN       NaN

In [111]:
df10.join(df20,how = 'right')

   key11  key21  key31  key41  key1   key2  key3      key4
1    1.0    7.0   13.0   19.0     1      7    13        19
2    2.0    8.0   14.0   20.0     2      8    14        20
3    3.0    9.0   15.0   21.0     3  kumar    15        21
4    4.0   10.0   16.0   22.0     4     10    16   ineuron
5    5.0   11.0   17.0   23.0     5     11    17  pwskills
6    NaN    NaN    NaN    NaN  sudh     12    18        24

In [113]:
pd.concat([df10,df20],axis=0)

    key11  key21  key31  key41  key1   key2  key3      key4
1     1.0    7.0   13.0   19.0   NaN    NaN   NaN       NaN
2     2.0    8.0   14.0   20.0   NaN    NaN   NaN       NaN
3     3.0    9.0   15.0   21.0   NaN    NaN   NaN       NaN
4     4.0   10.0   16.0   22.0   NaN    NaN   NaN       NaN
5     5.0   11.0   17.0   23.0   NaN    NaN   NaN       NaN
kj    6.0   12.0   18.0   24.0   NaN    NaN   NaN       NaN
1     NaN    NaN    NaN    NaN     1      7  13.0        19
2     NaN    NaN    NaN    NaN     2      8  14.0        20
3     NaN    NaN    NaN    NaN     3  kumar  15.0        21
4     NaN    NaN    NaN    NaN     4     10  16.0   ineuron
5     NaN    NaN    NaN    NaN     5     11  17.0  pwskills
6     NaN    NaN    NaN    NaN  sudh     12  18.0        24

In [114]:
pd.concat([df1,df2],axis=0)

   key1   key2  key3      key4
0     1      7    13        19
1     2      8    14        20
2     3      9    15        21
3     4     10    16        22
4     5     11    17        23
5     6     12    18        24
0     1      7    13        19
1     2      8    14        20
2     3  kumar    15        21
3     4     10    16   ineuron
4     5     11    17  pwskills
5  sudh     12    18        24

In [116]:
pd.concat([df1,df2],axis=1)

  key1 key2  key3 key4  key1   key2  key3      key4
0    1    7    13   19     1      7    13        19
1    2    8    14   20     2      8    14        20
2    3    9    15   21     3  kumar    15        21
3    4   10    16   22     4     10    16   ineuron
4    5   11    17   23     5     11    17  pwskills
5    6   12    18   24  sudh     12    18        24

In [117]:
#join, merge and concat completed above!

## Numpy

In [119]:
#matlab library (can use neural network)

In [120]:
# resilient back propogation algorithm

In [121]:
# numpy is like a mathmetical version of matplotlib

In [122]:
import numpy as np

In [123]:
l = [1,2,3,4,5]

In [124]:
type(l)

list

In [125]:
np.array(l)

array([1, 2, 3, 4, 5])

In [126]:
a = np.array(l)

In [127]:
type(a)

numpy.ndarray

In [128]:
a

array([1, 2, 3, 4, 5])

In [129]:
a1 = np.array(([1,2,3],[3,4,5]))

In [130]:
a1

array([[1, 2, 3],
       [3, 4, 5]])

In [139]:
a2 = np.array([[[1,2,3],[4,.5,6]]])

In [140]:
a2

array([[[1. , 2. , 3. ],
        [4. , 0.5, 6. ]]])

In [133]:
a.ndim

1

In [134]:
a1.ndim

2

In [141]:
a2.ndim

3

In [142]:
a3 = np.array([[[1,2,3],[4,.5,6]],[[1,2,3],[4,.5,6]],[[1,2,3],[4,.5,6]]])

In [143]:
a3

array([[[1. , 2. , 3. ],
        [4. , 0.5, 6. ]],

       [[1. , 2. , 3. ],
        [4. , 0.5, 6. ]],

       [[1. , 2. , 3. ],
        [4. , 0.5, 6. ]]])

In [144]:
a3.ndim

3

In [145]:
l = [1,2,3,4]

In [154]:
a = np.asarray(l)
a

array([1, 2, 3, 4])

In [155]:
m = np.matrix(l)
m

matrix([[1, 2, 3, 4]])

In [158]:
np.asanyarray(l)

array([1, 2, 3, 4])

In [159]:
np.asanyarray(a)

array([1, 2, 3, 4])

In [160]:
np.asanyarray(m)

matrix([[1, 2, 3, 4]])

In [161]:
a

array([1, 2, 3, 4])

In [162]:
a1 = a

In [163]:
a1

array([1, 2, 3, 4])

In [164]:
a

array([1, 2, 3, 4])

In [166]:
a[0] = 10

In [167]:
a

array([10,  2,  3,  4])

In [168]:
a1

array([10,  2,  3,  4])

In [169]:
a1[3]

4

In [170]:
a1[3] = 50

In [172]:
a2 = np.copy(a)

In [173]:
a2

array([10,  2,  3, 50])

In [174]:
a2[2] = 30

In [175]:
a2

array([10,  2, 30, 50])

In [176]:
a

array([10,  2,  3, 50])

In [177]:
np.fromfunction(lambda i,j: i==j, (3,4))

array([[ True, False, False, False],
       [False,  True, False, False],
       [False, False,  True, False]])

In [178]:
np.random.rand(2,3)

array([[0.46579075, 0.2607359 , 0.82955549],
       [0.56578219, 0.96374526, 0.0434876 ]])

In [179]:
np.random.rand(2,4,4)

array([[[0.47855458, 0.87273676, 0.28315298, 0.51446604],
        [0.44986063, 0.47028017, 0.21687061, 0.60750846],
        [0.1449327 , 0.9635208 , 0.19441954, 0.84408881],
        [0.33003433, 0.56401335, 0.90126037, 0.78585505]],

       [[0.08353222, 0.73378725, 0.982419  , 0.52142099],
        [0.0945883 , 0.96533766, 0.60348995, 0.11238046],
        [0.4734746 , 0.06901929, 0.41294392, 0.65134255],
        [0.35445066, 0.61725529, 0.75337293, 0.88865564]]])

In [181]:
np.random.rand(3,4,2,2)

array([[[[0.64049459, 0.77573013],
         [0.71926266, 0.44892227]],

        [[0.84009494, 0.20315227],
         [0.37054443, 0.23023723]],

        [[0.40691689, 0.01894058],
         [0.1566998 , 0.91938191]],

        [[0.45475121, 0.506175  ],
         [0.27890979, 0.69142195]]],


       [[[0.62399741, 0.76676974],
         [0.40868421, 0.89364717]],

        [[0.52926819, 0.0446848 ],
         [0.66634149, 0.9220114 ]],

        [[0.08338972, 0.14994914],
         [0.34726823, 0.30359848]],

        [[0.34490027, 0.17245711],
         [0.71144734, 0.75390875]]],


       [[[0.61634642, 0.41875753],
         [0.81579508, 0.64894972]],

        [[0.88676143, 0.42408165],
         [0.60991136, 0.02225624]],

        [[0.47828294, 0.66220175],
         [0.12957745, 0.68257385]],

        [[0.10716467, 0.15116361],
         [0.91376726, 0.44175097]]]])

In [182]:
np.random.rand(3,4,4)

array([[[0.20291266, 0.02893144, 0.40433613, 0.7892664 ],
        [0.51622347, 0.12931816, 0.03215632, 0.10285794],
        [0.01212978, 0.45455003, 0.47614107, 0.1010109 ],
        [0.05188324, 0.45068766, 0.40326259, 0.7076754 ]],

       [[0.67130771, 0.48454187, 0.2548849 , 0.15700692],
        [0.21607962, 0.62723656, 0.81422569, 0.92941636],
        [0.62422312, 0.76390028, 0.14903493, 0.86008729],
        [0.61963725, 0.34007182, 0.58991453, 0.5192817 ]],

       [[0.07189306, 0.85807612, 0.75927872, 0.05570581],
        [0.61195518, 0.76550512, 0.24673572, 0.81024004],
        [0.34204263, 0.19208634, 0.96003583, 0.7784971 ],
        [0.8465797 , 0.63318241, 0.11479214, 0.50314869]]])

In [190]:
kj = np.random.randn(3,4,2,2)
#mean = 0 and sd = 1

In [203]:
print(np.std(kj))
print(np.mean(kj))

0.952492259384386
-0.10173142714329475

In [188]:
np.random.randint(0,10,(4,4))

array([[7, 8, 0, 4],
       [6, 3, 9, 3],
       [3, 1, 5, 0],
       [7, 0, 7, 3]])

In [189]:
np.random.randint(0,10,(4,4,2))

array([[[5, 9],
        [1, 5],
        [9, 4],
        [8, 0]],

       [[6, 3],
        [6, 0],
        [0, 6],
        [5, 8]],

       [[3, 4],
        [3, 9],
        [2, 2],
        [8, 6]],

       [[7, 6],
        [0, 2],
        [8, 7],
        [0, 3]]])

In [216]:
d1 = np.random.rand(4,4,2)

In [223]:
pd.DataFrame(d1.reshape((16,2)))

           0         1
0   0.196198  0.640073
1   0.245585  0.436846
2   0.367923  0.982820
3   0.184858  0.300670
4   0.497584  0.856482
5   0.669575  0.883668
6   0.418543  0.534589
7   0.037568  0.116086
8   0.022446  0.441208
9   0.293928  0.559498
10  0.856583  0.041580
11  0.997529  0.816398
12  0.844603  0.665533
13  0.514678  0.438578
14  0.308928  0.546940
15  0.469019  0.985181

In [221]:
pd.DataFrame(d1)

ValueError: Must pass 2-d input. shape=(4, 4, 2)